{"keras_version": "1.2.0", "config": [{"config": {"nb_row": 5, "subsample": [1, 1], "dim_ordering": "tf", "init": "glorot_uniform", "trainable": true, "bias": true, "input_dtype": "float32", "nb_col": 5, "b_constraint": null, "W_constraint": null, "border_mode": "valid", "nb_filter": 12, "name": "convolution2d_1", "b_regularizer": null, "W_regularizer": null, "batch_input_shape": [null, 80, 160, 3], "activity_regularizer": null, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "trainable": true, "strides": [2, 2], "name": "maxpooling2d_1", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"nb_row": 5, "bias": true, "dim_ordering": "tf", "init": "glorot_uniform", "trainable": true, "subsample": [1, 1], "nb_col": 5, "b_constraint": null, "W_constraint": null, "border_mode": "valid", "nb_filter": 24, "name": "convolution2d_2", "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "trainable": true, "strides": [2, 2], "name": "maxpooling2d_2", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"nb_row": 3, "bias": true, "dim_ordering": "tf", "init": "glorot_uniform", "trainable": true, "subsample": [1, 1], "nb_col": 3, "b_constraint": null, "W_constraint": null, "border_mode": "valid", "nb_filter": 24, "name": "convolution2d_3", "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "trainable": true, "strides": [2, 2], "name": "maxpooling2d_3", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"nb_row": 3, "bias": true, "dim_ordering": "tf", "init": "glorot_uniform", "trainable": true, "subsample": [1, 1], "nb_col": 3, "b_constraint": null, "W_constraint": null, "border_mode": "valid", "nb_filter": 24, "name": "convolution2d_4", "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "trainable": true, "strides": [2, 2], "name": "maxpooling2d_4", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "trainable": true, "bias": true, "b_constraint": null, "W_constraint": null, "input_dim": 336, "output_dim": 200, "activity_regularizer": null, "name": "dense_1", "b_regularizer": null, "W_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_5", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"p": 0.1, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "trainable": true, "bias": true, "b_constraint": null, "W_constraint": null, "input_dim": 200, "output_dim": 100, "activity_regularizer": null, "name": "dense_2", "b_regularizer": null, "W_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_6", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"p": 0.1, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "trainable": true, "bias": true, "b_constraint": null, "W_constraint": null, "input_dim": 100, "output_dim": 1, "activity_regularizer": null, "name": "dense_3", "b_regularizer": null, "W_regularizer": null, "activation": "linear"}, "class_name": "Dense"}], "class_name": "Sequential"}